zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Multican/Std/IfxMultican.h
/** \} */

/** \addtogroup IfxLld_Multican_Std_Node
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Activate the CAN Node. Participate in the CAN bus activities
 * \param hwNode Pointer to CAN Node registers
 * \return None
 */
IFX_INLINE void IfxMultican_Node_activate(Ifx_CAN_N *hwNode);

/** \brief Deactivate the CAN Node. Take out from participation in the CAN bus activities
 * \param hwNode Pointer to CAN Node registers
 * \return None
 */
IFX_INLINE void IfxMultican_Node_deactivate(Ifx_CAN_N *hwNode);

/** \brief Disables the configuration changes for the Bit Timing Register, the Port Control Register, and the Error Counter Register of a CAN Node.
 * \param hwNode Pointer to CAN Node registers
 * \return None
 */
IFX_INLINE void IfxMultican_Node_disableConfigurationChange(Ifx_CAN_N *hwNode);

/** \brief Enables the configuration changes for the Bit Timing Register, the Port Control Register, and the Error Counter Register of a CAN Node.
 * \param hwNode Pointer to CAN Node registers
 * \return None
 */
IFX_INLINE void IfxMultican_Node_enableConfigurationChange(Ifx_CAN_N *hwNode);

/** \brief Returns the base address to a given CAN node number
 * \param mcan Specifies the CAN module
 * \param node Specifies the CAN node
 * \return base pointer to CAN node
 */
IFX_INLINE Ifx_CAN_N *IfxMultican_Node_getPointer(Ifx_CAN *mcan, IfxMultican_NodeId node);

/** \brief Resets the control register of CAN Node x.
 * \param hwNode Pointer to CAN Node registers
 * \return None
 */
IFX_INLINE void IfxMultican_Node_resetControlRegister(Ifx_CAN_N *hwNode);

/** \brief Resets the error counters of CAN Node x.
 * \param hwNode Pointer to CAN Node registers
 * \return None
 */
IFX_INLINE void IfxMultican_Node_resetErrorCounters(Ifx_CAN_N *hwNode);

/** \brief Resets the interrupt pointers of CAN Node x.
 * \param hwNode Pointer to CAN Node registers
 * \return None
 */
IFX_INLINE void IfxMultican_Node_resetInterruptPointers(Ifx_CAN_N *hwNode);

/** \brief Enables / Disables the alert interrupt of CAN node x.
 * \param hwNode Pointer to CAN Node registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setAlertInterrupt(Ifx_CAN_N *hwNode, boolean enabled);

/** \brief Selects the interrupt output line INT_Om
 * (m = 0-15) for an alert interrupt of CAN Node x.
 * \param hwNode Pointer to CAN Node registers
 * \param srcId Service request ID
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setAlertInterruptPointer(Ifx_CAN_N *hwNode, IfxMultican_SrcId srcId);

/** \brief Enables / Disables the analyzer mode of CAN node x.
 * \param hwNode Pointer to CAN Node registers
 * \param mode Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setAnalyzerMode(Ifx_CAN_N *hwNode, boolean mode);

/** \brief Determines the threshold value (warning level, default 96) to be reached\n
 * in order to set the corresponding error warning bit EWRN.
 * \param hwNode Pointer to CAN Node registers
 * \param level Error warning level
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setErrorWarningLevel(Ifx_CAN_N *hwNode, uint8 level);

/** \brief Enables / Disables the flexible data rate of CAN node x.
 * \param hwNode Pointer to CAN Node registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setFastNode(Ifx_CAN_N *hwNode, boolean enabled);

/** \brief Enables / Disables the CAN frame counter overflow interrupt of CAN node x.
 * \param hwNode Pointer to CAN Node registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setFrameCounterInterrupt(Ifx_CAN_N *hwNode, boolean enabled);

/** \brief Selects the interrupt output line INT_Om
 * (m = 0-15) for a frame counter overflow interrupt of CAN Node x.
 * \param hwNode Pointer to CAN Node registers
 * \param srcId Service request ID
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setFrameCounterInterruptPointer(Ifx_CAN_N *hwNode, IfxMultican_SrcId srcId);

/** \brief Sets the operation mode of the frame counter of the CAN Node x
 * \param hwNode Pointer to CAN Node registers
 * \param mode Determines the operation mode of the frame counter
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setFrameCounterMode(Ifx_CAN_N *hwNode, IfxMultican_FrameCounterMode mode);

/** \brief Enables / Disables the last error code interrupt of CAN node x. \n
 * This interrupt is generated with each hardware update of bit field NSRx.LEC with LEC > 0 (CAN protocol error).
 * \param hwNode Pointer to CAN Node registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setLastErrorCodeInterrupt(Ifx_CAN_N *hwNode, boolean enabled);

/** \brief Selects the interrupt output line INT_Om
 * (m = 0-15) for an LEC interrupt of CAN Node x.
 * \param hwNode Pointer to CAN Node registers
 * \param srcId Service request ID
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setLastErrorCodeInterruptPointer(Ifx_CAN_N *hwNode, IfxMultican_SrcId srcId);

/** \brief Enables / Disables the loopback mode of CAN node x.
 * \param hwNode Pointer to CAN Node registers
 * \param mode Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setLoopBackMode(Ifx_CAN_N *hwNode, boolean mode);

/** \brief Sets the value of the receive error counter of CAN node x.
 * \param hwNode Pointer to CAN Node registers
 * \param value Receive error counter value
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setReceiveErrorCounter(Ifx_CAN_N *hwNode, uint8 value);

/** \brief Selects the interrupt output line INT_Om
 * (m = 0-15) for a timer event interrupt of CAN Node x.
 * \param hwNode Pointer to CAN Node registers
 * \param srcId Service request ID
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setTimerEventInterruptPointer(Ifx_CAN_N *hwNode, IfxMultican_SrcId srcId);

/** \brief Enables / Disables the transceiver delay compensation of CAN node x.
 * \param hwNode Pointer to CAN Node registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setTransceiverDelayCompensation(Ifx_CAN_N *hwNode, boolean enabled);

/** \brief Sets transceiver delay ompensation offset of CAN node x.
 * \param hwNode Pointer to CAN Node registers
 * \param value transceiver delay ompensation offset that is added to the measured transceiver delay. Range = [0, 15]
 * \return None
 */
IFX_INLINE void IfxMultican_Node_setTransceiverDelayCompensationOffset(Ifx_CAN_N *hwNode, uint16 value);

