zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Multican/Std/IfxMultican.h
/** \brief Gets data length code of a message object
 * \param hwObj Pointer to CAN message object registers
 * \return CAN frame data length code
 */
IFX_INLINE IfxMultican_DataLengthCode IfxMultican_MsgObj_getDataLengthCode(Ifx_CAN_MO *hwObj);

/** \brief Gets message identifier of message object
 * \param hwObj Pointer to CAN message object registers
 * \return messageId
 */
IFX_INLINE uint32 IfxMultican_MsgObj_getMessageId(Ifx_CAN_MO *hwObj);

/** \brief Returns next object pointer (PNEXT) of the current message object
 * \param hwObj Pointer to CAN message object registers
 * \return Next message object number
 */
IFX_INLINE IfxMultican_MsgObjId IfxMultican_MsgObj_getNextObjectPointer(Ifx_CAN_MO *hwObj);

/** \brief Get base address of a message object register
 * \param mcan Specifies the CAN module
 * \param msgObjId Specifies the message object index. Range = [0, \ref IFXMULTICAN_NUM_MESSAGE_OBJECTS - 1]
 * \return Pointer to Message Object registers
 */
IFX_INLINE Ifx_CAN_MO *IfxMultican_MsgObj_getPointer(Ifx_CAN *mcan, IfxMultican_MsgObjId msgObjId);

/** \brief Get the message object status
 * \param hwObj Pointer to CAN message object registers
 * \return Extended frame: True
 * Standard frame: False
 */
IFX_INLINE boolean IfxMultican_MsgObj_isExtendedFrame(Ifx_CAN_MO *hwObj);

/** \brief Returns the RX pending flag of a message object.
 * \param hwObj Pointer to CAN message object registers
 * \return TRUE of the RX pending flag of a message object is set
 */
IFX_INLINE boolean IfxMultican_MsgObj_isRxPending(Ifx_CAN_MO *hwObj);

/** \brief Returns the TX Request flag of a message object.
 * \param hwObj Pointer to CAN message object registers
 * \return TRUE of the TX Request flag of a message object is set
 */
IFX_INLINE boolean IfxMultican_MsgObj_isTransmitRequested(Ifx_CAN_MO *hwObj);

/** \brief Returns the TX pending flag of a message object.
 * \param hwObj Pointer to CAN message object registers
 * \return TRUE of the TX pending flag of a message object is set
 */
IFX_INLINE boolean IfxMultican_MsgObj_isTxPending(Ifx_CAN_MO *hwObj);

/** \brief Sets acceptance mask for the message identifier
 * \param hwObj Pointer to CAN message object registers
 * \param mask Acceptance Mask for the message identifier
 * \param extendedFrame Extended frame enabled / disabled
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setAcceptanceMask(Ifx_CAN_MO *hwObj, uint32 mask, boolean extendedFrame);

/** \brief Enable / Disable bit rate switch of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setBitRateSwitch(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Sets bottom object pointer of the base message object
 * \param hwObj Pointer to CAN message object registers
 * \param objNumber Bottom message object number
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setBottomObjectPointer(Ifx_CAN_MO *hwObj, sint32 objNumber);

/** \brief Sets bottom current pointer of the base message object
 * \param hwObj Pointer to CAN message object registers
 * \param objNumber Current message object number
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setCurrentObjectPointer(Ifx_CAN_MO *hwObj, sint32 objNumber);

/** \brief Enable / Disable data copy of a gateway source message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setDataCopy(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Sets data length code of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param code CAN frame data length code
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setDataLengthCode(Ifx_CAN_MO *hwObj, IfxMultican_DataLengthCode code);

/** \brief Enable / Disable data length code copy of a gateway source message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setDataLengthCodeCopy(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Enable / Disable extended data length of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setExtendedDataLength(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Enable / Disable gateway data frame send of a gateway source message object
 * which in turn sets the TXRQ of the gateway deatination object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setGatewayDataFrameSend(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Enable / Disable identifier copy of a gateway source message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setIdentifierCopy(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Sets identifier extension of message object
 * \param hwObj Pointer to CAN message object registers
 * \param extension Acceptance Mask for the message IDE bit
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setIdentifierExtension(Ifx_CAN_MO *hwObj, boolean extension);

/** \brief Sets acceptance mask for the message IDE bit
 * \param hwObj Pointer to CAN message object registers
 * \param matchingId Acceptance Mask for the message IDE bit
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setMatchingId(Ifx_CAN_MO *hwObj, boolean matchingId);

/** \brief Sets message identifier of message object
 * \param hwObj Pointer to CAN message object registers
 * \param messageId CAN Identifier of message object
 * \param extendedFrame Extended frame enabled / disabled
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setMessageId(Ifx_CAN_MO *hwObj, uint32 messageId, boolean extendedFrame);

/** \brief Sets the message mode of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param mode CAN Message Object Mode
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setMessageMode(Ifx_CAN_MO *hwObj, IfxMultican_MsgObjMode mode);

