zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Multican/Std/IfxMultican.h
/** \brief Sets message pending number that selects the bit position of the bit in the Message Pending Register\n
 * that is set upon a message object n receive/transmit interrupt
 * \param hwObj Pointer to CAN message object registers
 * \param messageNumber Message pending number
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setMessagePendingNumber(Ifx_CAN_MO *hwObj, IfxMultican_MsgObjId messageNumber);

/** \brief Enable / Disable overflow interrupt of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setOverflowInterrupt(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Sets priority class of message object
 * \param hwObj Pointer to CAN message object registers
 * \param priority One of the priority classes 0, 1, 2, 3 to message object n
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setPriorityClass(Ifx_CAN_MO *hwObj, IfxMultican_Priority priority);

/** \brief Enable / Disable receive interrupt of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setReceiveInterrupt(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Sets receive interrupt node pointer of message object
 * \param hwObj Pointer to CAN message object registers
 * \param srcId Service request ID
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setReceiveInterruptNodePointer(Ifx_CAN_MO *hwObj, IfxMultican_SrcId srcId);

/** \brief Enable / Disable transmit object remote monitoring of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setRemoteMonitoring(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Sets bottom object select pointer of the base message object
 * \param hwObj Pointer to CAN message object registers
 * \param objNumber Select message object number
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setSelectObjectPointer(Ifx_CAN_MO *hwObj, sint32 objNumber);

/** \brief Enable / Disable single data transfer of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setSingleDataTransfer(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Enable / Disable single transmit trial of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setSingleTransmitTrial(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Sets top object pointer of the base message object
 * \param hwObj Pointer to CAN message object registers
 * \param objNumber Top message object number
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setTopObjectPointer(Ifx_CAN_MO *hwObj, sint32 objNumber);

/** \brief Enable / Disable transmit interrupt of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param enabled Enable / disable choice
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setTransmitInterrupt(Ifx_CAN_MO *hwObj, boolean enabled);

/** \brief Sets transmit interrupt node pointer of message object
 * \param hwObj Pointer to CAN message object registers
 * \param srcId Service request ID
 * \return None
 */
IFX_INLINE void IfxMultican_MsgObj_setTransmitInterruptNodePointer(Ifx_CAN_MO *hwObj, IfxMultican_SrcId srcId);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Cancel pending TX request by invalidating the request, only when frame transmission has not been started.
 * \param hwObj Pointer to CAN message object registers
 * \return TRUE if cancellation was successfully executed
 */
IFX_EXTERN boolean IfxMultican_MsgObj_cancelSend(Ifx_CAN_MO *hwObj);

/** \brief Clears the selected status flag of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param flag Message Object status flag
 * \return None
 */
IFX_EXTERN void IfxMultican_MsgObj_clearStatusFlag(Ifx_CAN_MO *hwObj, IfxMultican_MsgObjStatusFlag flag);

/** \brief Reset the message object\n
 * Append the message object to the end of idle list and reset message object registers
 * \param mcan Specifies the CAN module
 * \param msgObjId Specifies the message object index. Range = [0, \ref IFXMULTICAN_NUM_MESSAGE_OBJECTS - 1]
 * \return None
 */
IFX_EXTERN void IfxMultican_MsgObj_deinit(Ifx_CAN *mcan, IfxMultican_MsgObjId msgObjId);

/** \brief Get message object ID which has TX/RX pending flag from a message object group
 * \param mcan Specifies the CAN module
 * \param msgObjGroup Message object group
 * \return Message object index
 */
IFX_EXTERN IfxMultican_MsgObjId IfxMultican_MsgObj_getPendingId(Ifx_CAN *mcan, IfxMultican_MsgObjGroup msgObjGroup);

/** \brief Get the message object status
 * \param hwObj Pointer to CAN message object registers
 * \return \ref IfxMultican_MsgObjStat bitfield
 */
IFX_EXTERN IfxMultican_MsgObjStat IfxMultican_MsgObj_getStatus(Ifx_CAN_MO *hwObj);

/** \brief Gets the status of the selected status flag of a message object
 * \param hwObj Pointer to CAN message object registers
 * \param flag Message Object status flag
 * \return Status (TRUE / FALSE)
 */
IFX_EXTERN boolean IfxMultican_MsgObj_getStatusFlag(Ifx_CAN_MO *hwObj, IfxMultican_MsgObjStatusFlag flag);

/** \brief Read a received CAN long frame
 * \param mcan Specifies the CAN module
 * \param msgObjId Specifies the message object index. Range = [0, \ref IFXMULTICAN_NUM_MESSAGE_OBJECTS - 1]
 * \param msg The message which should be initialized
 * \param data Pointer to data (in words)
 * \return IfxMultican_Status_newData: if the operation was successful\n
 * IfxMultican_Status_newDataButMessageLost: if the one message lost and last new data is retrieved successfully\n
 * IfxMultican_Status_messageLost: if the message lost and new data is not yet ready\n
 * IfxMultican_Status_receiveEmpty: if no message is been received
 */
IFX_EXTERN IfxMultican_Status IfxMultican_MsgObj_readLongFrame(Ifx_CAN *mcan, IfxMultican_MsgObjId msgObjId, IfxMultican_Message *msg, uint32 *data);

/** \brief Read a received CAN message
 * \param hwObj Pointer to CAN message object registers
 * \param msg This parameter is filled in by the function with the received message. Also when reading is not successful.
 * \return IfxMultican_Status_newData: if the operation was successful\n
 * IfxMultican_Status_newDataButMessageLost: if the one message lost and last new data is retrieved successfully\n
 * IfxMultican_Status_messageLost: if the message lost and new data is not yet ready\n
 * IfxMultican_Status_receiveEmpty: if no message is been received
 */
IFX_EXTERN IfxMultican_Status IfxMultican_MsgObj_readMessage(Ifx_CAN_MO *hwObj, IfxMultican_Message *msg);

/** \brief Send a CAN Long frame message
 * \param mcan Specifies the CAN module
 * \param msgObjId Specifies the message object index. Range = [0, \ref IFXMULTICAN_NUM_MESSAGE_OBJECTS - 1]
 * \param msg The message which should be initialized
 * \param data Pointer to data (in words)
 * \return IfxMultican_Status_ok: if the operation was successful
 * IfxMultican_Status_notSentBusy: if the operation was unsuccessful due to hardware is busy
 */
IFX_EXTERN IfxMultican_Status IfxMultican_MsgObj_sendLongFrame(Ifx_CAN *mcan, IfxMultican_MsgObjId msgObjId, IfxMultican_Message *msg, uint32 *data);

